; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph3 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star5 - direction
	Star4 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star8 spectrograph0)
	(have_image Phenomenon9 thermograph3)
	(have_image Star10 thermograph3)
	(have_image Star11 spectrograph0)
	(have_image Star12 thermograph2)
))

)

; plan
1. (turn_to satellite0 star4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite0 star12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star12)
   goals met: 0 of 5
5. (take_image satellite0 star12 instrument2 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite0 star5 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 5
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 5
9. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 5
11. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 2 of 5
12. (turn_to satellite0 star10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star10)
   goals met: 2 of 5
13. (take_image satellite0 star10 instrument1 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 3 of 5
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 5
15. (take_image satellite0 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 4 of 5
16. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 4 of 5
17. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 5 of 5
